fix: remove background from diagrams, adjust image size
